[
    {
        "id": 1,
        "titulo": "Jogo Acerte a Palavra",
        "texto": "Jogo Acere a palavra é um jogo inspirado no famoso Wordle e nas suas versões brasileiras: Termo, Palavra do Dia e Letreco."
    },
    {
        "id": 2,
        "titulo": "Calculadora",
        "texto": "Projeto de uma calculadora com JavaScript."
    },
    {
        "id": 3,
        "titulo": "Formulário de Cadastro",
        "texto": "### Introdução \n\n Formulários da web são uma parte fundamental de muitos sites e aplicativos, permitindo que os usuários interajam e enviem informações para os proprietários do site. Um formulário da web é uma interface interativa que coleta dados inseridos pelos usuários, como nome, endereço de e-mail, mensagem, etc., e os envia para o servidor do site para processamento. Esses formulários são amplamente utilizados em uma variedade de contextos, como formulários de contato, inscrições em newsletters, login de usuários, enquetes e muito mais. \n\n Os formulários da web geralmente são compostos por campos de entrada, botões de envio e outros elementos de interface do usuário que permitem que os usuários preencham e enviem informações. Esses campos podem ser de vários tipos, como campos de texto, caixas de seleção, botões de rádio, menus suspensos e outros, e podem ter requisitos de validação para garantir que os dados inseridos estejam corretos. \n\n ### O Projeto \n\n \n\n O projeto Formulário de Cadastro foi um estudo de caso para a prática e aprendizagem de um formulário padrão da web. Para a criação desta aplicação, utilizei as seguintes tecnologias: ```HTML```, ```CSS``` e ```JavaScript``` \n\n ![image](https://user-images.githubusercontent.com/109925623/232343646-1e0dde79-cb28-4808-832b-9cc9643e3cdb.png) \n\n\n Além das funcionalidades padrão do formulário, a aplicação é responsiva, o que torna a página adequada para diferentes formatos de telas. \n\n Esse foi meu primeiro contato com as ```media queries```, onde para cada dimensão em pixels declarada, os elementos serão dispostos de maneiras diferentes. \n\n ### Links \n[GitHub](https://github.com/jobemcamera/responsive-registration-form) \n\n [Deploy](https://responsive-registration-form-ox1gcxkkh-jobemcamera.vercel.app/)"
    },
    {
        "id": 4,
        "titulo": "Card Avaliação de Usuário",
        "texto": "Card de avaliação de um serviço ou produto pelo usuário."
    },
    {
        "id": 5,
        "titulo": "Jogo Acerte o Número Secreto",
        "texto": "Jogo Acerte o Número Secreto."
    },
    {
        "id": 6,
        "titulo": "Easybank Landing Page",
        "texto": "Landing Page do Easybank."
    },
    {
        "id": 7,
        "titulo": "Loopstudios Landing Page",
        "texto": "Loopstudios Landing Page."
    },
    {
        "id": 8,
        "titulo": "Bookmark Landing Page",
        "texto": "Bookmark Landing Page."
    }
]