[
    {
        "id": 1,
        "titulo": "Card Avaliação do Usuário",
        "texto": "### Introdução \n\n Um card de avaliação do usuário é uma ferramenta valiosa para compartilhar opiniões sobre sites na internet. Esses cards são geralmente criados por usuários que desejam compartilhar sua experiência sobre um site específico, seja ele uma loja virtual, um blog, uma rede social, um aplicativo para celular ou qualquer outro tipo de plataforma online. O objetivo principal dos cards de avaliação é fornecer informações úteis para outros usuários que estão considerando visitar ou utilizar o site em questão. Eles geralmente incluem uma pontuação ou classificação geral, além de comentários detalhados sobre a navegação, a interface, a qualidade do conteúdo e outros aspectos relevantes do site. Os cards de avaliação do usuário são especialmente úteis para aqueles que desejam fazer compras online, mas também podem ser utilizados para fins educacionais, de entretenimento e muito mais. Ao compartilhar suas experiências, os usuários podem ajudar outros a tomar decisões informadas e a ter uma experiência mais agradável na internet.\n\n ### O Projeto \n\n Este projeto foi o meu primeiro desafio desde que voltei para o mundo da programação em agosto de 2022. Como já estava aprendendo HTML e CSS, a princípio, decidi que era a hora de colocar a mão na massa. É claro que naquele momento, deveria ser algo mais simples para que eu pudesse concluir o meu desafio. \n\n ![image](https://user-images.githubusercontent.com/109925623/233808446-5e8a5699-f037-4f63-8c02-cf9550363cb4.png) \n\n Criei uma interface de com textos informativos, um display com 5 estrelas, um caixa de texto e um botão enviar. As estrelas representam uma nota de 1 a 5 referente ao serviço prestado. A caixa de texto, diferentemente das estrelas, não é obrigatório e serve para o usuário adicionar um texto referente a sua experiência. Após o click do botão enviar, é mostrado um novo display com o agradecimento, a nota que você deu marcando as estrelas e o texto, se houver. \n\n ![image](https://user-images.githubusercontent.com/109925623/233808564-fe157b46-3c1c-4beb-9e1e-401e5aa81edb.png) \n\n O maior desafio deste projeto foi enteder o funcionamento das estrelas, pois ao clicar em uma, as anteriores também ficavam acessas. Além disso, tive o contato com JavaScript, já que era com ele que eu manipulava o evento de click do botão. \n\n Por mais que pareça simples a aplicação, este projeto foi de exterma importância para a minha caminhada. A partir deste, foram abrindo as portas para maiores desafios. \n\n Para mais informações sobre as etapas de desenvolvimento, você poderá conferir no repositório diretamente no GitHub, conforme link abaixo. \n\n ### Links \n[GitHub](https://github.com/jobemcamera/avaliacao-usuario) \n\n [Deploy](https://avaliacao-usuario.vercel.app/)"
    },
    {
        "id": 2,
        "titulo": "ToDo List",
        "texto": "### Introdução \n\n Uma ToDo List é uma ferramenta simples, mas poderosa, que ajuda as pessoas a organizar e gerenciar suas tarefas diárias, semanais ou mensais. Em sua essência, uma ToDo List é uma lista de tarefas que precisam ser realizadas, geralmente organizadas por ordem de prioridade ou por prazo de entrega. Essas listas podem ser criadas em papel ou por meio de aplicativos de produtividade, e podem ser compartilhadas com colegas de trabalho, amigos e familiares para fins de colaboração ou para delegar tarefas. A ToDo List é uma maneira eficaz de manter o foco, aumentar a produtividade e reduzir o estresse, uma vez que as tarefas são claramente definidas e podem ser riscadas à medida que são concluídas. Ao utilizar uma ToDo List, as pessoas podem gerenciar melhor seu tempo e priorizar suas atividades com base em suas necessidades e objetivos pessoais e profissionais. \n\n ### O Projeto \n\n Este foi meu segundo projeto Front-End desde a retomada em agosto de 2022. Bem mais desafiador que o anterior, este projeto necessitava de mais conhecimento em JavaScript, no caso a manipulação do DOM. \n\n A manipulação do DOM em JavaScript é uma das principais técnicas usadas para criar interatividade e dinamismo em aplicações web. Com o JavaScript, é possível acessar os elementos da página HTML e modificar seus atributos, estilos e conteúdo de forma dinâmica, permitindo que a página reaja a eventos e interaja com o usuário. A manipulação do DOM é realizada através de métodos fornecidos pela API do DOM, como **getElementById**, **querySelector**, **createElement**, entre outros. Esses métodos permitem que o desenvolvedor acesse os elementos da página, adicione novos elementos, altere o conteúdo existente, modifique os estilos CSS e manipule eventos. A manipulação do DOM em JavaScript é uma técnica poderosa que permite que os desenvolvedores criem experiências de usuário altamente personalizadas e interativas, melhorando a usabilidade e a eficácia das aplicações web. \n\n ![image](https://user-images.githubusercontent.com/109925623/233810804-4fb7329b-b7b7-4168-b2ae-8976d94c1878.png) \n\n Além do conceito de DOM, o conceito de **arrow function** foi utilizado neste contexto. \n\n Para mais informações sobre as etapas de desenvolvimento, você poderá conferir no repositório diretamente no GitHub, conforme link abaixo. \n\n ### Links \n [GitHub](https://github.com/jobemcamera/to-do-list) \n\n [Deploy](https://to-do-list-gamma-one.vercel.app/) "
    },
    {
        "id": 3,
        "titulo": "Intro Section Dropdown",
        "texto": "Intro Section Dropdown"
    },
    {
        "id": 4,
        "titulo": "Formulário de Cadastro",
        "texto": "### Introdução \n\n Formulários da web são uma parte fundamental de muitos sites e aplicativos, permitindo que os usuários interajam e enviem informações para os proprietários do site. Um formulário da web é uma interface interativa que coleta dados inseridos pelos usuários, como nome, endereço de e-mail, mensagem, etc., e os envia para o servidor do site para processamento. Esses formulários são amplamente utilizados em uma variedade de contextos, como formulários de contato, inscrições em newsletters, login de usuários, enquetes e muito mais. \n\n Os formulários da web geralmente são compostos por campos de entrada, botões de envio e outros elementos de interface do usuário que permitem que os usuários preencham e enviem informações. Esses campos podem ser de vários tipos, como campos de texto, caixas de seleção, botões de rádio, menus suspensos e outros, e podem ter requisitos de validação para garantir que os dados inseridos estejam corretos. \n\n ### O Projeto \n\n O projeto Formulário de Cadastro foi um estudo de caso para a prática e aprendizagem de um formulário padrão da web. Para a criação desta aplicação, utilizei as seguintes tecnologias: \n\n - HTML; \n - CSS; \n - JavaScript. \n\n ![image](https://user-images.githubusercontent.com/109925623/232343646-1e0dde79-cb28-4808-832b-9cc9643e3cdb.png) \n\n\n Além das funcionalidades padrão do formulário, a aplicação é responsiva, o que torna a página adequada para diferentes formatos de telas. \n\n Esse foi meu primeiro contato com as **media queries**, onde para cada dimensão em pixels declarada, os elementos serão dispostos de maneiras diferentes. \n\n ### Links \n [GitHub](https://github.com/jobemcamera/responsive-registration-form) \n\n [Deploy](https://responsive-registration-form-ox1gcxkkh-jobemcamera.vercel.app/)"
    },
    {
        "id": 5,
        "titulo": "Calculadora",
        "texto": "Projeto de uma calculadora com JavaScript."
    },
    {
        "id": 6,
        "titulo": "Easybank Landing Page",
        "texto": "Landing Page do Easybank."
    },
    {
        "id": 7,
        "titulo": "Loopstudios Landing Page",
        "texto": "Loopstudios Landing Page."
    },
    {
        "id": 8,
        "titulo": "Bookmark Landing Page",
        "texto": "Bookmark Landing Page."
    },
    {
        "id": 9,
        "titulo": "Jogo Acerte a Palavra",
        "texto": "### Introdução \n\n Você já jogou aquele famoso jogo [Wordle](https://www.nytimes.com/games/wordle/index.html)? E as versões brasileiras [Palavra do Dia](https://palavra-do-dia.pt/), [Termo](https://term.ooo/) e [Letreco](https://www.gabtoschi.com/letreco/)? Eu adoro esses jogos e depois de passar um bom tempo neles, decidi criar minha própria versão: [Acerte a Palavra](https://acerteapalavra.vercel.app/). \n\n ![image](https://user-images.githubusercontent.com/109925623/225011820-3081e930-d763-4109-8d11-ec61a1ac8ec3.png) \n\n\n ### Motivação \n\n\n Voltando um pouco no tempo, em agosto de 2022, eu comecei a pensar em como fazer uma versão desses jogos. Naquela época, eu praticava as palavras neles diariamente, e estava começando a aprender a tríade do Front-End: HTML, CSS e JavaScript. As únicas coisas que eu consegui fazer foram criar o repositório no GitHub e uma tela cheia de inputs. De fato, eu precisava estudar mais... E então, a jornada começou! \n\n\n ### O Jogo \n\n\n O objetivo do jogo é acertar a palavra sorteada em 6 tentivas. Para cada letra inserida que formará a palavra, será analisada e terá como retorno uma cor específica. São elas: \n\n - Verde: Letra existe na palavra e está na posição correta; \n - Amarelo: Letra existe mas está na posição errada; \n - Cinza: Letra não existe na palavra. \n\n ![image](https://user-images.githubusercontent.com/109925623/225012209-0b16cab1-7242-46df-99ac-887e54b1c95e.png) \n\nPalavras inválidas não serão contabilizadas como erro, portanto o usuário poderá apagar a palavra e tentar novamente. Se o usuário acertar a palavra, para cada ordem de tentativa (1 à 6), uma mensagem personalizada de vitória será mostrada na tela. Caso o usuário esgote todas as tentativas, a palavra sorteada será mostrada na tela. \n\n Diferentemente dos jogos anteriormente mencionados, o Acerte a Palavra é mais dinâmico, ou seja, a cada vitória ou derrota, o usuário poderá jogar novamente, não tendo que esperar o dia seguinte para jogar de novo. \n\n ### O Desenvolvimento \n\n Para a criação do jogo, foram utilizadas as seguintes tecnologias: \n\n - HTML; \n - CSS; \n - JavaScript. \n\n Para alimentar Para alimentar uma lista de palavras de 5 letras, foi utilizada a lista do [Dicio](https://www.dicio.com.br/palavras-com-cinco-letras/) que contém 1000 exemplares. Ao longo dos meus testes e feedback de amigos, fui incluindo manualmente novas palavras possíveis. \n\n Utilizei duas abordagens diferentes para Mobile/Tablet e Desktop. Para Mobile/Tablet, o usuário poderá utilizar o teclado virtual para inserir as letras nos inputs, não sendo possível escolher a ordem delas, somente seguindo o que o jogo permitir. \n\n ![image](https://user-images.githubusercontent.com/109925623/225013015-19c74374-82de-4852-a617-5ef65d994815.png) \n\n Para a versão Desktop, o teclado virtual é bloqueado, sendo possível somente utilizar o teclado físico da máquina. Aqui o usuário poderá escolher a ordem de digitação das letras, bastando dar foco (clicando) no input que quiser. \n\n Essa diferença de abordagem dos dispositivos foi devido a minha escolha de trabalhar com inputs do tipo texto. Isso fez com que tivesse que manipular eventos de click e foco, além da lógica de avançar e voltar com as letras nos inputs. \n\n Cada usuário poderá conferir suas estatísticas de acordo com os jogos que participar. Há um botão que na página que irá abrir um Modal com as seguintes informações: \n\n - Número de jogos; \n - Número de vitórias; \n - Sequência de vitórias; \n - Melhor sequência; \n - Gráfico em barras indicando a quantidade de derrotas e vitórias para cada ordem de acerto (1 a 6 tentativas). \n\n ![image](https://user-images.githubusercontent.com/109925623/225012103-fed15b26-1c95-4441-8acb-6d3995db89fa.png) \n\n Todas as informações dessas estatísticas são salvas no LocalStorage do navegador que o usuário estiver jogando.\n\n Para mais informações sobre as etapas de desenvolvimento, você poderá conferir no repositório diretamente no GitHub, conforme link abaixo. \n\n ### Links \n[GitHub](https://github.com/jobemcamera/palavra-do-dia) \n\n [Deploy](https://acerteapalavra.vercel.app/)"
    },
    {
        "id": 10,
        "titulo": "Tibia Data",
        "texto": "Em construção..."   
    }
]